app/controllers/daemon_controller.rb

  def start
    @listener = Listener.find(params[:id])
---
SELECT * FROM `listeners` WHERE (`listeners`.`id` = 1)

  def stop
    @listener = Listener.find(params[:id])
---
SELECT * FROM `listeners` WHERE (`listeners`.`id` = 1)