app/controllers/listeners_controller.rb

  def index
    @page_title = "Listeners"
    @listeners = Listener.all
---
SELECT * FROM `listeners`

  def show
    @listener = Listener.find(params[:id])
---
SELECT * FROM `listeners` WHERE (`listeners`.`id` = 1)

  def edit
    @listener = Listener.find(params[:id])
---
SELECT * FROM `listeners` WHERE (`listeners`.`id` = 1)

  def create
    @listener = Listener.new(params[:listener])

    respond_to do |format|
      if @listener.save
---
INSERT INTO `listeners` (`broker_url`, `created_at`, `updated_at`, `status`, `user`, `password`, `action_url`) VALUES('broker-url', '2009-06-01 23:15:56', '2009-06-01 23:15:56', NULL, 'kenb', 'password', 'http://localhost:3000/listeners/update')