app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`) VALUES('listener_daemon_1', '-6119970680.472659148670518', '2009-06-01 18:19:01', '2009-06-01 18:19:01', '96ad5afc7c8e8e425650a9f82cd084732afa8683')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save